In [1]:
import os
import django
os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'rest.settings')
os.environ["DJANGO_ALLOW_ASYNC_UNSAFE"] = "true"
django.setup()

In [2]:
Car.objects.all()

In [3]:
for i in Car.objects.all():
    print(i)

1 Mitsubishi L200
2 Mini Cooper
3 TVR Tuscan
4 BMW Z3
5 Toyota Cella

In [4]:
import pandas as pd
df = pd.DataFrame(list(Car.objects.all().values()))
df

   id       maker   model        price   color        date
0   1  Mitsubishi    L200   4500000.00  Purple  2022-01-20
1   2        Mini  Cooper   4000000.00     Red  2022-01-20
2   3         TVR  Tuscan  15000000.00  Yellow  2022-01-20
3   4         BMW      Z3  10000000.00     Red  2022-01-20
4   5      Toyota   Cella   5000000.00   Black  2022-01-20

In [5]:
pd.DataFrame(list(Client.objects.all().values()))

   id      name       address postcode              email       phone
0   1     Wasit  Pathum thani    12120     wasit@tu.ac.th  0876543210
1   2  Einstein  Pathum Thani    12120  einstein@tu.ac.th  0876543211
2   3     David        Bankok    10100    david@email.com  0987654321

In [6]:
pd.DataFrame(list(Rent.objects.all().values()))

   id  car_id  client_id   rent_date return_date    cost
0   1       1          1  2022-01-20  2022-01-20  200.00
1   2       3          2  2022-01-20  2022-01-21  500.00
2   3       5          1  2022-02-17  2022-02-17  600.00
3   4       2          1  2022-02-17  2022-02-17  500.00

In [7]:
#q1 มีการเช่าครั้งไหนบ้างที่ราคารถมากกว่าหรือเท่ากับ 5ล้าน
pd.DataFrame(list( Rent.objects.filter(car__price__gt=5000000).values() ))

   id  car_id  client_id   rent_date return_date    cost
0   2       3          2  2022-01-20  2022-01-21  500.00

In [8]:
#q2 มีลูกค้าคนไหนบ้างที่เช่ารถ โดยรถนั้นราคามากกว่าหรือเท่ากับ 5ล้าน?
query_set=Client.objects.filter(rent__car__price__gt=5000000).values()
pd.DataFrame(list(query_set))

   id      name       address postcode              email       phone
0   2  Einstein  Pathum Thani    12120  einstein@tu.ac.th  0876543211

In [9]:
print(Client.objects.filter(rent__car__price__gt=5000000).values().query)

SELECT "myapp_client"."id", "myapp_client"."name", "myapp_client"."address", "myapp_client"."postcode", "myapp_client"."email", "myapp_client"."phone" FROM "myapp_client" INNER JOIN "myapp_rent" ON ("myapp_client"."id" = "myapp_rent"."client_id") INNER JOIN "myapp_car" ON ("myapp_rent"."car_id" = "myapp_car"."id") WHERE "myapp_car"."price" > 5000000

In [10]:
#q3 มีรถคันไหนบ้างที่ยืมโดย wasit และรถราคาน้อยกว่า 5ล้าน